In [1]:
import numpy as np
import pandas as pd

In [6]:
cd = pd.read_csv('Toyota.csv',index_col=0,na_values=["??","????"])

In [35]:
cdt = cd.copy()

In [36]:
cdt2 = cd.copy()
cdt3 = cd.copy()

In [37]:
#cdt.dropna(axis=0,inplace=True)

### Check NULL values in the Pandas Dataframe
1. isnull()
2. isna()

In [38]:
cdt.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [39]:
cdt.isna().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

### Subsetting the Rows with missing values

In [40]:
miss = cdt[cdt.isnull().any(axis=1)]
# cdt.isnull().any(axis=1)

In [41]:
miss

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
6,16900,27.0,NaN,Diesel,NaN,NaN,0,2000,3,1245
7,18600,30.0,75889.0,NaN,90.0,1.0,0,2000,3,1245
9,12950,23.0,71138.0,Diesel,NaN,NaN,0,1900,3,1105
15,22000,28.0,18739.0,Petrol,NaN,0.0,0,1800,3,1185
...,...,...,...,...,...,...,...,...,...,...
1428,8450,72.0,NaN,Petrol,86.0,NaN,0,1300,3,1015
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015

### Approaches to fill the Missing Values
1. by Mean/Median for Numerical Variables
2. by Class with max count for Categorical Variable

### Steps
* Look at the description to know whether numerical variables should be imputed with mean or median.
* Generate descriptive statistics that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values

DataFrame.describe()

DataFrame.fillna()

In [48]:
cdt.describe()

,Price,Age,KM,HP,MetColor,Automatic,CC,Weight
count,1436.000000,1436.000000,1421.000000,1436.000000,1286.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,68647.239972,101.478322,0.674961,0.055710,1566.827994,1072.45961
std,3626.964585,17.930380,37333.023589,14.737348,0.468572,0.229441,187.182436,52.64112
min,4350.000000,1.000000,1.000000,69.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,44.000000,43210.000000,90.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,59.000000,63634.000000,110.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,68.000000,87000.000000,110.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,1.000000,1.000000,2000.000000,1615.00000

In [66]:
cdt.describe()

,Price,Age,KM,HP,MetColor,Automatic,CC,Weight
count,1436.000000,1436.000000,1436.000000,1436.000000,1436.000000,1436.000000,1436.000000,1436.00000
mean,10730.824513,55.672156,68594.873259,101.478322,0.708914,0.055710,1566.827994,1072.45961
std,3626.964585,17.930380,37140.890566,14.737348,0.454421,0.229441,187.182436,52.64112
min,4350.000000,1.000000,1.000000,69.000000,0.000000,0.000000,1300.000000,1000.00000
25%,8450.000000,44.000000,43505.750000,90.000000,0.000000,0.000000,1400.000000,1040.00000
50%,9900.000000,59.000000,63634.000000,110.000000,1.000000,0.000000,1600.000000,1070.00000
75%,11950.000000,68.000000,86916.000000,110.000000,1.000000,0.000000,1600.000000,1085.00000
max,32500.000000,80.000000,243000.000000,192.000000,1.000000,1.000000,2000.000000,1615.00000

In [43]:
cdt['Age'].mean()

55.67215568862275

In [44]:
cdt['Age'].median()

60.0

### Fill NA for Numerical Variables

In [45]:
cdt['Age'].fillna(cdt['Age'].mean(), inplace=True)

In [64]:
# cdt['KM'].isna().sum()
# cdt['KM'].median()
cdt['KM'].fillna(cdt['KM'].median(), inplace=True)

In [46]:
# cdt['HP'].isna().sum()
# cdt['HP'].mean()
cdt['HP'].fillna(cdt['HP'].mean(), inplace=True)

In [47]:
cdt.isna().sum()

Price          0
Age            0
KM            15
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

### Fill NA for Categorical Variables
* Series.value_counts()
* mode()

In [49]:
# Output is always in DESC
cdt['FuelType'].value_counts()

Petrol    1177
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [52]:
cdt['FuelType'].value_counts().index[0]

'Petrol'

In [54]:
# Fill NA/NaN Values
# cdt['FuelType'].isna().sum()
cdt['FuelType'].fillna(cdt['FuelType'].value_counts().index[0], inplace=True)

In [60]:
# cdt['MetColor'].mode()[0]
cdt['MetColor'].mode()

0    1.0
dtype: float64

In [61]:
# Fill NA/NaN Values
# cdt['MetColor'].isna().sum()
cdt['MetColor'].fillna(cdt['MetColor'].mode()[0], inplace=True)

In [67]:
cdt2.isna().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

## Fill NA Values in one go for both data types
dataframe.apply(lambda ...)

In [68]:
cdt2 = cdt2.apply(lambda x:x.fillna(x.mean()) if x.dtype == 'float' else x.fillna(x.value_counts().index[0]))

In [69]:
cdt2.isna().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64